app/controllers/boards_controller.rb

  def create
    # TODO: perhaps use flash message for error instead
    @board = Board.new(params[:board])
    @board.user_id = current_user.id

    if @board.save
---
INSERT INTO "boards" ("created_at", "image", "images", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sat, 22 Aug 2015 22:51:49 UTC +00:00], ["image", "men1.jpg"], ["images", nil], ["name", "Sam Test Board"], ["updated_at", Sat, 22 Aug 2015 22:51:49 UTC +00:00], ["user_id", 2]]

  def show
    @board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", "17"]]