app/controllers/home_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = 2
---
  def index
    @data = {
      boards: Board.where(user_id: current_user.id)