app/controllers/home_controller.rb

SELECT "boards".* FROM "boards"
---
  def index
    # TODO: change this to be user boards when users get set up
    @data = {
      boards: Board.all,
    }